package qa.task;

/**
 * В этом классе реализовать метод stepUp.
 * ДЕЛАТЬ ЗАДАНИЕ ТУТ в методе stepUp.
 */
public class RobotDispatcher {

    /**
     * Реализовать метод.
     *
     * @param robot     Robot который будем двигать, заряжать и очищать, чтобы он добрался до нужной ступени.
     * @param stepIndex Индекс ступени до которой необходимо добраться.
     */
    public void stepUp(Robot robot, int stepIndex) {

        /* Тут написать свой код реализации на любом языке или в виде блок-схемы или на псевдо-языке */

    }
}
